app/controllers/books_controller.rb

INSERT INTO "books" ("name", "author", "price", "quantity", "created_at", "updated_at", "shops_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "book1"], ["author", "author1"], ["price", 100.11], ["quantity", 200], ["created_at", "2021-04-03 03:42:43.146204"], ["updated_at", "2021-04-03 03:42:43.146204"], ["shops_id", 1]]
---
    def create
        request_body = JSON.parse(request.raw_post)
        name = request_body['name']
        author = request_body['author']
        price = request_body['price']
        quantity = request_body['quantity']
        shops_id = request_body['shops_id']

        @book = Book.create(name: name, author: author, price: price, quantity: quantity, shops_id: shops_id)

SELECT "books".* FROM "books"
---
    def index
        @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        begin
            @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "name" = $1, "author" = $2, "price" = $3, "quantity" = $4, "updated_at" = $5, "shops_id" = $6 WHERE "books"."id" = $7  [["name", "book1-update"], ["author", "author1-update"], ["price", 999.99], ["quantity", 900], ["updated_at", "2021-04-03 04:19:40.175197"], ["shops_id", 2], ["id", 1]]
---
    def update
        begin
            @book = Book.find(params[:id])

            if @book
                request_body = JSON.parse(request.raw_post)
                name = request_body['name']
                author = request_body['author']
                price = request_body['price']
                quantity = request_body['quantity']
                shops_id = request_body['shops_id']
                @book.update(name: name, author: author, price: price, quantity: quantity, shops_id: shops_id)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
---
    def destroy
        begin
            @book = Book.find(params[:id])

            if @book
                @book.destroy