app/controllers/orders_controller.rb

  def create
    request_body = JSON.parse(request.raw_post)
    order_detail = request_body['order_detail']
    users_id = request_body['users_id']
    shops_id = request_body['shops_id']

    order = Order.create(order_detail: order_detail, users_id: users_id, shops_id: shops_id)
---
INSERT INTO "orders" ("created_at", "updated_at", "users_id", "shops_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2021-04-03 03:33:19.109775"], ["updated_at", "2021-04-03 03:33:19.109775"], ["users_id", 2], ["shops_id", 1]]

  def index
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def show
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]