app/controllers/shops_controller.rb

    def create
        request_body = JSON.parse(request.raw_post)
        name = request_body['name']
        address = request_body['address']

        @shop = Shop.create(name: name, address: address)
---
INSERT INTO "shops" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "shop"], ["address", "hongkong"], ["created_at", "2021-04-03 03:28:07.200107"], ["updated_at", "2021-04-03 03:28:07.200107"]]

    def index
        @shops = Shop.all
---
SELECT "shops".* FROM "shops"

    def show
        begin
            @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        begin
            @shop = Shop.find(params[:id])

            if @shop
                request_body = JSON.parse(request.raw_post)
                name = request_body['name']
                address = request_body['address']
                @shop.update(name: name, address: address)
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "shops" SET "name" = $1, "address" = $2, "updated_at" = $3 WHERE "shops"."id" = $4  [["name", "shop-update"], ["address", "kowloon"], ["updated_at", "2021-04-03 04:18:02.890380"], ["id", 1]]

    def destroy
        begin
            @shop = Shop.find(params[:id])

            if @shop
                @shop.destroy
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "shops" WHERE "shops"."id" = $1  [["id", 1]]