app/controllers/users_controller.rb

  def signup
    request_body = JSON.parse(request.raw_post)
    email = request_body['email']
    password = request_body['password']

    hash_password = helpers.get_hash_password(password)

    user = User.create(email: email, password: hash_password)
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def login
    request_body = JSON.parse(request.raw_post)
    email = request_body['email']
    password = request_body['password']

    user = User.find_by(email: email)

    if user.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test3@test.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def change_password
    user = User.find(params[:id])

    if user.present?
      request_body = JSON.parse(request.raw_post)
      old_password = request_body['old_password']
      new_password = request_body['new_password']

      if user.password == helpers.get_hash_password(old_password)
        user.update(password: new_password)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
UPDATE "users" SET "password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password", "t"], ["updated_at", "2021-04-03 04:26:24.101308"], ["id", 1]]